Tekla Open API Reference for Tekla Structures 2025
AssemblyDrawing Constructor (Identifier)
 Instantiates a new assembly drawing with standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AssemblyDrawing(
	Identifier assemblyIdentifier
)
Public Sub New (
	assemblyIdentifier As Identifier
)
Parameters
assemblyIdentifier
Type: Tekla.Structures.Identifier
The identifier of the model object assembly
See Also
Reference
AssemblyDrawing Class
AssemblyDrawing Overload
Tekla.Structures.Drawing Namespace